// 自動生成されたコードです。変更しないでください。
namespace myImages {

    helpers._registerFactory("image", function(name: string) {
        switch(helpers.stringTrim(name)) {
            case "image1":return img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
`;
            case "image2":
            case "bogy":return img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . 2 . . . 
. . . . . . . . . . . 2 2 . . . 
. . . . . . . . . . 2 2 4 . . . 
. . . . . . . . . 2 2 4 4 . . . 
. . . . . . . . 2 2 4 4 4 . . . 
. . . . . 2 2 2 1 1 4 4 4 . . . 
. 2 2 2 2 4 4 4 4 4 4 4 4 f . f 
. . . . . 4 4 4 4 4 4 4 4 . f . 
. . . . . . . . 4 4 4 4 4 . . . 
. . . . . . . . . 4 4 4 4 . . . 
. . . . . . . . . . 4 4 4 . . . 
. . . . . . . . . . . 4 4 . . . 
. . . . . . . . . . . . 4 . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
`;
        }
        return null;
    })

    helpers._registerFactory("animation", function(name: string) {
        switch(helpers.stringTrim(name)) {

        }
        return null;
    })

}
// 自動生成されたコードです。変更しないでください。
